app/controllers/tests_controller.rb

  def index
    @tests = Test.all
---
SELECT name FROM `tests`

  def index1
    @tests = Test.all
---
SELECT * FROM `tests`

  def show
    @test = Test.find(params[:id])
---
SELECT * FROM `tests` WHERE (`tests`.`id` = 1)

  def edit
    @test = Test.find(params[:id])
---
SELECT * FROM `tests` WHERE (`tests`.`id` = 1)

  def create
    @test = Test.new(params[:test])

    respond_to do |format|
      if @test.save
---
INSERT INTO `tests` (`name`, `roll`, `updated_at`, `created_at`) VALUES('Sunny', 1, '2009-12-19 03:52:19', '2009-12-19 03:52:19')

  def update
    @test = Test.find(params[:id])

    respond_to do |format|
      if @test.update_attributes(params[:test])
---
SELECT * FROM `tests` WHERE (`tests`.`id` = 1)
UPDATE `tests` SET `roll` = 2, `updated_at` = '2009-12-19 03:52:33' WHERE `id` = 1

  def destroy
    @test = Test.find(params[:id])
    @test.destroy
---
SELECT * FROM `tests` WHERE (`tests`.`id` = 1)
DELETE FROM `tests` WHERE `id` = 1